[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:74:61
                             id="url"
                             type="text"
                             isInvalid={Boolean(errors.url)}
-                            {...register("url", { required: "url is required." })}
+                            {...register("url", { required: "" })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /url is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:74:49
                             id="url"
                             type="text"
                             isInvalid={Boolean(errors.url)}
-                            {...register("url", { required: "url is required." })}
+                            {...register("url", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /url is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:110:51
                             id="email"
                             type="text"
                             isInvalid={Boolean(errors.email)}
-                            {...register("email", {
-                                required: "email is required."
-                            })}
+                            {...register("email", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:130:30
                             {...register("dateAdded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateAdded && 'dateAdded is required. '}
+                            {true}
                             {/* {errors.dateAdded?.type === "pattern" && 'Date must be in isodate format'} */}
                         </Form.Control.Feedback>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /dateAdded is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:130:30
                             {...register("dateAdded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateAdded && 'dateAdded is required. '}
+                            {errors.dateAdded || 'dateAdded is required. '}
                             {/* {errors.dateAdded?.type === "pattern" && 'Date must be in isodate format'} */}
                         </Form.Control.Feedback>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
