[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:40:21
             accessor: 'title',
         },
         {
-            Header: 'url',
+            Header: "",
             accessor: 'url',
         },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: url. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.js:43:9
             Header: 'url',
             accessor: 'url',
         },
-        {
-            Header: 'explanation',
-            accessor: 'explanation',
-        },
+        {},
         {
             Header: 'email',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:44:21
             accessor: 'url',
         },
         {
-            Header: 'explanation',
+            Header: "",
             accessor: 'explanation',
         },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: explanation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:53:23
         },
         {
             Header: 'dateAdded',
-            accessor: 'dateAdded',
+            accessor: "",
         }
     ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2024-05-03T00:12:53.905Z
Received:
