[Killed] ObjectLiteral
main/pages/Articles/ArticlesCreatePage.js:9:45
 
 export default function ArticlesCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (article) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: article.dateAdded
-    }
-  });
+  const objectToAxiosParams = (article) => ({});
 
   const onSuccess = (article) => {
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
