[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:21:26
     const navigate = useNavigate();
 
     // testIdPrefix
-    const testIdPrefix = "UCSBOrganizationForm";
+    const testIdPrefix = "";
 
 // String orgCode
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:43:46
                                 required: "OrgCode is required.",
                                 maxLength: {
                                     value: 10,
-                                    message: "Max length 10 characters"
+                                    message: ""
                                 }
                             })}
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 10 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:60:65
                             id="orgTranslationShort"
                             type="text"
                             isInvalid={Boolean(errors.orgTranslationShort)}
-                            {...register("orgTranslationShort", { 
-                                required: "OrgTranslationShort is required.",
-                                maxLength: {
-                                    value: 20,
-                                    message: "Max length 20 characters"
-                                }
-                            })}
+                            {...register("orgTranslationShort", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /OrgTranslationShort is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:82:56
                         id="orgTranslation"
                         type="text"
                         isInvalid={Boolean(errors.orgTranslation)}
-                        {...register("orgTranslation", { 
-                            required: "OrgTranslation is required." 
-                        })}
+                        {...register("orgTranslation", {})}
                     />
                     <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /OrgTranslation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:83:39
                         type="text"
                         isInvalid={Boolean(errors.orgTranslation)}
                         {...register("orgTranslation", { 
-                            required: "OrgTranslation is required." 
+                            required: "" 
                         })}
                     />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /OrgTranslation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
