[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:9:31
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsborganization) => ({
-    url: "/api/UCSBOrganization/post",
-    method: "POST",
-    params: {
-      orgCode: ucsborganization.orgCode,
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      inactive: ucsborganization.inactive
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsborganization) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:11:13
 
   const objectToAxiosParams = (ucsborganization) => ({
     url: "/api/UCSBOrganization/post",
-    method: "POST",
+    method: "",
     params: {
       orgCode: ucsborganization.orgCode,
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:12:13
   const objectToAxiosParams = (ucsborganization) => ({
     url: "/api/UCSBOrganization/post",
     method: "POST",
-    params: {
-      orgCode: ucsborganization.orgCode,
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      inactive: ucsborganization.inactive
-    }
+    params: {}
   });
 
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "inactive": "false",
-   "orgCode": "abc",

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:20:43
     }
   });
 
-  const onSuccess = (ucsborganization) => {
-    toast(`New UCSB Organization Created - orgCode: ${ucsborganization.orgCode}`);
-  }
+  const onSuccess = (ucsborganization) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSB Organization Created - orgCode: abc"

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:21:11
   });
 
   const onSuccess = (ucsborganization) => {
-    toast(`New UCSB Organization Created - orgCode: ${ucsborganization.orgCode}`);
+    toast(``);
   }
 
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSB Organization Created - orgCode: abc"
Received: ""

Number of calls: 1
