[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:41:23
         },
         {
             Header: 'OrgTranslationShort',
-            accessor: 'orgTranslationShort',
+            accessor: "",
         },
         {
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgTranslationShort"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:45:23
         },
         {
             Header: 'OrgTranslation',
-            accessor: 'orgTranslation',
+            accessor: "",
         },
         {
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgTranslation"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:47:9
             Header: 'OrgTranslation',
             accessor: 'orgTranslation',
         },
-        {
-            Header: 'Inactive',
-            accessor: 'inactive',
-        }
+        {}
     ];
 
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.js:53:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
-        // columns.push(ButtonColumn("Delete", "danger", testIdPrefix));
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
     return <OurTable
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
