[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:47:9
             Header: 'OrgTranslation',
             accessor: 'orgTranslation',
         },
-        {
-            Header: 'Inactive',
-            accessor: 'inactive',
-            Cell: ({ cell: { value } }) => (value ? "true" : "false")
-        }
+        {}
     ];
 
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.js:50:19
         {
             Header: 'Inactive',
             accessor: 'inactive',
-            Cell: ({ cell: { value } }) => (value ? "true" : "false")
+            Cell: () => undefined
         }
     ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:50:62
         {
             Header: 'Inactive',
             accessor: 'inactive',
-            Cell: ({ cell: { value } }) => (value ? "true" : "false")
+            Cell: ({ cell: { value } }) => (value ? "true" : "")
         }
     ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
