[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (ucsborganization) => ({
-        url: "/api/UCSBOrganization",
-        method: "PUT",
-        params: {
-            orgCode: ucsborganization.orgCode,
-        },
-        data: {
-            orgCode: ucsborganization.orgCode,
-            orgTranslationShort: ucsborganization.orgTranslationShort,
-            orgTranslation: ucsborganization.orgTranslation,
-            inactive: ucsborganization.inactive,
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (ucsborganization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSB Organization Updated - orgCode: TT"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:27:17
     const objectToAxiosPutParams = (ucsborganization) => ({
         url: "/api/UCSBOrganization",
         method: "PUT",
-        params: {
-            orgCode: ucsborganization.orgCode,
-        },
+        params: {},
         data: {
             orgCode: ucsborganization.orgCode,
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "orgCode": "TT",
- }

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:30:15
         params: {
             orgCode: ucsborganization.orgCode,
         },
-        data: {
-            orgCode: ucsborganization.orgCode,
-            orgTranslationShort: ucsborganization.orgTranslationShort,
-            orgTranslation: ucsborganization.orgTranslation,
-            inactive: ucsborganization.inactive,
-        }
+        data: {}
     });
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"orgCode\":\"TT\",\"orgTranslationShort\":\"Test more\",\"orgTranslation\":\"Test more more\",\"inactive\":\"true\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:38:45
         }
     });
 
-    const onSuccess = (ucsborganization) => {
-        toast(`UCSB Organization Updated - orgCode: ${ucsborganization.orgCode}`);
-    }
+    const onSuccess = (ucsborganization) => {}
 
     const mutation = useBackendMutation(
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:39:15
     });
 
     const onSuccess = (ucsborganization) => {
-        toast(`UCSB Organization Updated - orgCode: ${ucsborganization.orgCode}`);
+        toast(``);
     }
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSB Organization Updated - orgCode: TT"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:55:34
         mutation.mutate(data);
     }
 
-    if (isSuccess && !storybook) {
-        return <Navigate to="/ucsborganization" />
-    }
+    if (isSuccess && !storybook) {}
 
     return (
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsborganization"}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:64:21
             <div className="pt-2">
                 <h1>Edit UCSB Organization</h1>
                 {
-                    ucsborganization && <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsborganization} />
+                    true
                 }
             </div>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:64:21
             <div className="pt-2">
                 <h1>Edit UCSB Organization</h1>
                 {
-                    ucsborganization && <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsborganization} />
+                    false
                 }
             </div>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
